In [1]:
import pandas as pd

In [2]:
## path, file name, type

In [ ]:
pd.read_csv("path name")

In [8]:
cr=pd.read_csv(r"C:\Users\rks91\Downloads\New folder\CreditRisk.csv")# r is for raw

In [9]:
cr.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0.0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1.0,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0.0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0.0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0.0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [10]:
pwd

'C:\\Users\\rks91'

In [12]:
dr=pd.read_csv(r"CreditRisk.csv")

In [13]:
dr.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0.0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1.0,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0.0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0.0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0.0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [15]:
cr1=pd.read_clipboard()

In [16]:
cr1.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0.0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1.0,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0.0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0.0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0.0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [17]:
cr.shape

(981, 13)

In [18]:
cr.shape[0]

981

In [20]:
cr.shape[1]

13

In [21]:
cr1.tail()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
976,LP002971,Male,Yes,4.0,Not Graduate,Yes,4009,1777.0,113.0,360.0,1.0,Urban,Y
977,LP002975,Male,Yes,0.0,Graduate,No,4158,709.0,115.0,360.0,1.0,Urban,Y
978,LP002980,Male,No,0.0,Graduate,No,3250,1993.0,126.0,360.0,NaN,Semiurban,Y
979,LP002986,Male,Yes,0.0,Graduate,No,5000,2393.0,158.0,360.0,1.0,Rural,N
980,LP002989,Male,No,0.0,Graduate,Yes,9200,0.0,98.0,180.0,1.0,Rural,Y

In [22]:
cr.Gender#to select the coloumn

0      Male
1      Male
2      Male
3      Male
4      Male
       ...
976    Male
977    Male
978    Male
979    Male
980    Male
Name: Gender, Length: 981, dtype: object

In [23]:
cr['Gender']

0      Male
1      Male
2      Male
3      Male
4      Male
       ...
976    Male
977    Male
978    Male
979    Male
980    Male
Name: Gender, Length: 981, dtype: object

In [24]:
cr.ApplicantIncome.mean()

5179.795107033639

In [25]:
cr.ApplicantIncome.std()

5695.104532539108

In [26]:
cr.ApplicantIncome.median()

3800.0

In [28]:
cr.columns

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [30]:
cr.Gender.describe()

count      957
unique       2
top       Male
freq       775
Name: Gender, dtype: object

In [32]:
cr.Property_Area.describe()

count           981
unique            3
top       Semiurban
freq            349
Name: Property_Area, dtype: object

In [33]:
cr.Gender.value_counts()

Male      775
Female    182
Name: Gender, dtype: int64

In [34]:
cr.ApplicantIncome.describe()

count      981.000000
mean      5179.795107
std       5695.104533
min          0.000000
25%       2875.000000
50%       3800.000000
75%       5516.000000
max      81000.000000
Name: ApplicantIncome, dtype: float64

In [35]:
cr.Property_Area.value_counts()

Semiurban    349
Urban        342
Rural        290
Name: Property_Area, dtype: int64

In [36]:
cr.ApplicantIncome.value_counts()

2500     13
5000     11
3333     10
3500      9
2600      8
         ..
14999     1
4758      1
4755      1
4364      1
3691      1
Name: ApplicantIncome, Length: 752, dtype: int64

In [37]:
cr.describe()

,Dependents,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,956.000000,981.000000,981.000000,954.000000,961.000000,902.000000
mean,0.881799,5179.795107,1601.916330,142.511530,342.201873,0.835920
std,1.255623,5695.104533,2718.772806,77.421743,65.100602,0.370553
min,0.000000,0.000000,0.000000,9.000000,6.000000,0.000000
25%,0.000000,2875.000000,0.000000,100.000000,360.000000,1.000000
50%,0.000000,3800.000000,1110.000000,126.000000,360.000000,1.000000
75%,2.000000,5516.000000,2365.000000,162.000000,360.000000,1.000000
max,4.000000,81000.000000,41667.000000,700.000000,480.000000,1.000000

In [38]:
cr.describe(include='all')

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
count,981,957,978,956.000000,981,926,981.000000,981.000000,954.000000,961.000000,902.000000,981,981
unique,981,2,2,NaN,2,2,NaN,NaN,NaN,NaN,NaN,3,2
top,LP001237,Male,Yes,NaN,Graduate,No,NaN,NaN,NaN,NaN,NaN,Semiurban,Y
freq,1,775,631,NaN,763,807,NaN,NaN,NaN,NaN,NaN,349,712
mean,NaN,NaN,NaN,0.881799,NaN,NaN,5179.795107,1601.916330,142.511530,342.201873,0.835920,NaN,NaN
std,NaN,NaN,NaN,1.255623,NaN,NaN,5695.104533,2718.772806,77.421743,65.100602,0.370553,NaN,NaN
min,NaN,NaN,NaN,0.000000,NaN,NaN,0.000000,0.000000,9.000000,6.000000,0.000000,NaN,NaN
25%,NaN,NaN,NaN,0.000000,NaN,NaN,2875.000000,0.000000,100.000000,360.000000,1.000000,NaN,NaN
50%,NaN,NaN,NaN,0.000000,NaN,NaN,3800.000000,1110.000000,126.000000,360.000000,1.000000,NaN,NaN
75%,NaN,NaN,NaN,2.000000,NaN,NaN,5516.000000,2365.000000,162.000000,360.000000,1.000000,NaN,NaN
max,NaN,NaN,NaN,4.000000,NaN,NaN,81000.000000,41667.000000,700.000000,480.000000,1.000000,NaN,NaN

In [39]:
cr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 981 entries, 0 to 980
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            981 non-null    object
 1   Gender             957 non-null    object
 2   Married            978 non-null    object
 3   Dependents         956 non-null    float64
 4   Education          981 non-null    object
 5   Self_Employed      926 non-null    object
 6   ApplicantIncome    981 non-null    int64
 7   CoapplicantIncome  981 non-null    float64
 8   LoanAmount         954 non-null    float64
 9   Loan_Amount_Term   961 non-null    float64
 10  Credit_History     902 non-null    float64
 11  Property_Area      981 non-null    object
 12  Loan_Status        981 non-null    object
dtypes: float64(5), int64(1), object(7)
memory usage: 99.8+ KB

In [40]:
#lets find the null values

In [41]:
cr.isnull()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,False,False,False,False,False,False,False,False,True,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
976,False,False,False,False,False,False,False,False,False,False,False,False,False
977,False,False,False,False,False,False,False,False,False,False,False,False,False
978,False,False,False,False,False,False,False,False,False,False,True,False,False
979,False,False,False,False,False,False,False,False,False,False,False,False,False
980,False,False,False,False,False,False,False,False,False,False,False,False,False

In [42]:
cr.isnull().sum()

Loan_ID               0
Gender               24
Married               3
Dependents           25
Education             0
Self_Employed        55
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           27
Loan_Amount_Term     20
Credit_History       79
Property_Area         0
Loan_Status           0
dtype: int64

In [43]:
cr.isnull().sum()*100/cr.shape[0]#percentage of nulls

Loan_ID              0.000000
Gender               2.446483
Married              0.305810
Dependents           2.548420
Education            0.000000
Self_Employed        5.606524
ApplicantIncome      0.000000
CoapplicantIncome    0.000000
LoanAmount           2.752294
Loan_Amount_Term     2.038736
Credit_History       8.053007
Property_Area        0.000000
Loan_Status          0.000000
dtype: float64

In [44]:
cr.columns[cr.isnull().sum()*100/cr.shape[0]>5]

Index(['Self_Employed', 'Credit_History'], dtype='object')

In [45]:
cr.columns[cr.isnull().sum()*100/cr.shape[0]>0] #columns with nulls

Index(['Gender', 'Married', 'Dependents', 'Self_Employed', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History'],
      dtype='object')

In [46]:
#Handel nulls

In [51]:
cr.Gender=cr.Gender.fillna('Male')
cr.Married=cr.Married.fillna('Yes')
cr.LoanAmount=cr.LoanAmount.fillna(cr.LoanAmount.median())

In [56]:
cr.isnull().sum()

Loan_ID               0
Gender                0
Married               0
Dependents            0
Education             0
Self_Employed        55
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            0
Loan_Amount_Term      0
Credit_History       79
Property_Area         0
Loan_Status           0
dtype: int64

In [53]:
cr.Dependents=cr.Dependents.fillna(1)

In [ ]:
cr.Loan_Amount_Term.fillna(cr.Loan_Amount_Term.median,inplace=True)#Correct

In [55]:
cr.Loan_Amount_Term=cr.Loan_Amount_Term.fillna(cr.Loan_Amount_Term.median())

In [ ]:
#cr.Loan_Amount_Term=cr.Loan_Amount_Term.fillna(cr.Loan_Amount_Term.median(),inplace=True)

In [71]:
cr=pd.read_csv(r"C:\Users\rks91\Downloads\New folder\CreditRisk.csv")# r is for raw
cr.Loan_Amount_Term.fillna(cr.Loan_Amount_Term.median() , inplace = True) # correct
cr.isnull().sum()

Loan_ID               0
Gender               24
Married               3
Dependents           25
Education             0
Self_Employed        55
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           27
Loan_Amount_Term      0
Credit_History       79
Property_Area         0
Loan_Status           0
dtype: int64

In [75]:
cr=pd.read_csv(r"C:\Users\rks91\Downloads\New folder\CreditRisk.csv")
cr.Loan_Amount_Term =cr.Loan_Amount_Term.fillna(cr.Loan_Amount_Term.median() ) # correct
cr.isnull().sum()

Loan_ID               0
Gender               24
Married               3
Dependents           25
Education             0
Self_Employed        55
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           27
Loan_Amount_Term      0
Credit_History       79
Property_Area         0
Loan_Status           0
dtype: int64

In [59]:
cr=pd.read_csv(r"C:\Users\rks91\Downloads\New folder\CreditRisk.csv")
cr.Loan_Amount_Term = cr.Loan_Amount_Term.fillna(cr.Loan_Amount_Term.median() , inplace = True)
cr.isnull().sum()

Loan_ID                0
Gender                24
Married                3
Dependents            25
Education              0
Self_Employed         55
ApplicantIncome        0
CoapplicantIncome      0
LoanAmount            27
Loan_Amount_Term     981
Credit_History        79
Property_Area          0
Loan_Status            0
dtype: int64

In [60]:
cr.corr()#pearson,srearman rank,kednadals

,Dependents,ApplicantIncome,CoapplicantIncome,LoanAmount,Credit_History
Dependents,1.000000,0.137819,-0.003428,0.149586,-0.057913
ApplicantIncome,0.137819,1.000000,-0.114247,0.551811,0.023378
CoapplicantIncome,-0.003428,-0.114247,1.000000,0.179228,-0.027253
LoanAmount,0.149586,0.551811,0.179228,1.000000,-0.008235
Credit_History,-0.057913,0.023378,-0.027253,-0.008235,1.000000

In [62]:
df1=cr[cr.ApplicantIncome>3500]

In [63]:
df1.shape

(560, 13)

In [68]:
d21=cr[(cr.ApplicantIncome>3500) & (cr.Gender=='Male')]

In [69]:
d21.shape

(452, 13)

In [76]:
df2=cr[cr.ApplicantIncome>3500][cr.Gender=="Male"]

<ipython-input-76-6e7055626355>:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df2=cr[cr.ApplicantIncome>3500][cr.Gender=="Male"]

In [77]:
#select the records based on position
# i want to select columns-->1,4,7,10
# want to select row

#cr2=cr2[)c(10,100,500,600,700),c(1,4,7,10]
cr.iloc[[9,99,499,599,699],[0,3,6,9]]

      Loan_ID  Dependents  ApplicantIncome  Loan_Amount_Term
9    LP001020         1.0            12841             360.0
99   LP001343         0.0             1759             360.0
499  LP002602         0.0             6283             360.0
599  LP002948         2.0             5780             360.0
699  LP001452         2.0             4635             180.0

In [78]:
df2.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0.0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1.0,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
4,LP001008,Male,No,0.0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
5,LP001011,Male,Yes,2.0,Graduate,Yes,5417,4196.0,267.0,360.0,1.0,Urban,Y
8,LP001018,Male,Yes,2.0,Graduate,No,4006,1526.0,168.0,360.0,1.0,Urban,Y

In [79]:
#i waant to select coloumns--->1,4,7,10 and all rows
df3=cr.iloc[:,[0,3,6,9]]

In [80]:
df3.shape

(981, 4)

In [82]:
df4=cr.iloc[:,3:12]

In [83]:
df4.head()#Loan Status was not included

,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,0.0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban
1,1.0,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural
2,0.0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban
3,0.0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban
4,0.0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban

In [84]:
df5=cr.iloc[:,[3,4,5,6,7,8,9,10,11,12]]

In [85]:
df5.head()

,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,0.0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,1.0,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,0.0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,0.0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,0.0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y